AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ЗаявкаНаВозврат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаявкаНаВозврат</Name>
			<BasedOn>
				<xr:Item>Document.РеализацияТоваровУслуг</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзмененияЭтапаЭкспертизы</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Реализация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СертифицированнаяТорговаяТочка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаТовараКлиенту</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтампВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтапЭкспертизы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЭтапыЭкспретизы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОформленоНаПланшете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлПочтаКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСклада_СтороннийСклад</Name>
							<Comment>СправочникСсылка.СторонниеСклады</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.СторонниеСклады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСтрокиИзРТУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Статус</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КодыМаркировки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСтрокиКМ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМаркировки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ШтрихкодыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

WebServices/Nom_For_Return/Ext/Module.bsl
Функция Nom_For_Return(IncomingSettings)
	
	ВремяНачалаUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Nom_For_Return", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Запуск. Nom_For_Return");
	
	ЗаписьЖурналаРегистрации("Web-сервис Nom_For_Return",УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Параметры. Nom_For_Return: " + Символы.ПС + МСКWEB.ПолучитьОписаниеПараметровВэбСервиса(IncomingSettings));

	Результат = Nom_For_Return_(IncomingSettings);
	
	ВремяОкончанияUTC = ТекущаяУниверсальнаяДатаВМиллисекундах();
	ЗаписьЖурналаРегистрации("Web-сервис Nom_For_Return", УровеньЖурналаРегистрации.Информация,,, "Веб-сервис:Завершение. Nom_For_Return " + Формат((ВремяОкончанияUTC - ВремяНачалаUTC), "ЧН=0; ЧГ=0"));
		
	Возврат Результат; 		

КонецФункции

Функция Nom_For_Return_(ПараметрыОтбора) Экспорт
	
	//получаем входящие параметры
	пДатаНачалаОтчета	  = Дата(ПараметрыОтбора.BEGIN_DATE_);
	пДатаКонцаОтчета	  = Дата(ПараметрыОтбора.END_DATE_);
	пКодКонтрагентаПортал = ПараметрыОтбора.KONTRAGENT_;  	
	пАртикулТовара = ПараметрыОтбора.ARTICUL;
	пНомерДокумента = ПараметрыОтбора.NOMER_DOC;
	
	//разложим строку Филиалов
	пФилиалы		= СокрЛП(ПараметрыОтбора.FILIALS); 
	пСписокФилиалов = Новый Массив;
	ИскатьФилиалыПоКодуМДМ = Ложь;

	Если ЗначениеЗаполнено(пФилиалы) И НЕ Константы.НеПроверятьФилиалВВэбСервисах.Получить() Тогда
		
		пСписокФилиалов = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(СокрЛП(пФилиалы), ",");
		ИскатьФилиалыПоКодуМДМ = (пСписокФилиалов.Количество() > 0 И СтрДлина(пСписокФилиалов[0]) = 36);
		
	КонецЕсли;
	
	ИДАвардаКонтрагента = СтрЗаменить(СокрЛП(пКодКонтрагентаПортал), Символы.НПП, "");

	//Создаем объект для возврата
	ТипОтвет					= ФабрикаXDTO.Тип(Метаданные.WebСервисы.Nom_For_Return.ПространствоИмен, "RS_Nom_For_Return");
	РезультатДляВозвратаПорталу = ФабрикаXDTO.Создать(ТипОтвет);
	
	//Создаем строку ответа
	ТипСтрокаОтвета			    = ФабрикаXDTO.Тип(Метаданные.WebСервисы.Nom_For_Return.ПространствоИмен, "Out_Nom_For_Return");  
	
	//Ищем контрагента
	ИскатьПоКодуМДМ = СтрДлина(ИДАвардаКонтрагента) = 36;
	
	Если ИскатьПоКодуМДМ Тогда  
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("КодМДМ", ИДАвардаКонтрагента);	
	Иначе
		пКонтрагент = Справочники.Контрагенты.НайтиПоРеквизиту("IDАварда", ИДАвардаКонтрагента);	
	КонецЕсли;
	
	Если НЕ пКонтрагент.Пустая() Или НЕ пСписокФилиалов.Количество() = 0 Тогда
		
		ЗапросЗаказовПоСтатусам = Новый Запрос;
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаНач", ?(ЗначениеЗаполнено(пДатаНачалаОтчета), НачалоДня(пДатаНачалаОтчета), НачалоДня(ТекущаяДата() - 86400*14)));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДатаКон", ?(ЗначениеЗаполнено(пДатаКонцаОтчета), КонецДня(пДатаКонцаОтчета), КонецДня(ТекущаяДата())));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("IDАварда", ИДАвардаКонтрагента);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("СписокИД", пСписокФилиалов);
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("Артикул", ?(СокрЛП(пАртикулТовара) <> "", "%" + пАртикулТовара + "%", ""));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("АртикулНормализованный", ?(СокрЛП(пАртикулТовара) <> "", "%" + СтрЗаменить(СтрЗаменить(пАртикулТовара, " ", ""), "-", "") + "%", ""));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("НомерДокумента", СокрЛП(пНомерДокумента));
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ПоСпискуФилиалов", пСписокФилиалов.Количество() > 0);
		
		ДокументРеализации = Неопределено;
		
		Если ЗначениеЗаполнено(СокрЛП(пНомерДокумента)) Тогда
			
			Док = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(пНомерДокумента, пДатаКонцаОтчета);
			
			Если Не ЗначениеЗаполнено(Док) тогда
				
				Док = Документы.РеализацияТоваровУслуг.НайтиПоНомеру(пНомерДокумента, пДатаНачалаОтчета);
				
				Если ЗначениеЗаполнено(Док) тогда
					ДокументРеализации = Док;
				КонецЕсли;
				
			Иначе
				ДокументРеализации = Док;
			КонецЕсли;
			
		КонецЕсли;
						
		ЗапросЗаказовПоСтатусам.УстановитьПараметр("ДокументРеализации", ДокументРеализации);
		
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	СторонниеСклады.Идентификатор КАК Идентификатор,
		|	СторонниеСклады.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ СторонниеСклады
		|ИЗ
		|	Справочник.СторонниеСклады КАК СторонниеСклады
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Идентификатор
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ТаблицаКлиентов
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.IDАварда В(&СписокИД)
		|	И &ПоСпискуФилиалов = ИСТИНА
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	Контрагенты.Ссылка
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ГоловнойКонтрагент.IDАварда = &IDАварда
		|	И &ПоСпискуФилиалов = ЛОЖЬ
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Контрагенты.ГоловнойКонтрагент
		|ИЗ
		|	Справочник.Контрагенты КАК Контрагенты
		|ГДЕ
		|	Контрагенты.ГоловнойКонтрагент.IDАварда = &IDАварда
		|	И &ПоСпискуФилиалов = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаВозвратТовары.Номенклатура КАК Номенклатура,
		|	ЗаявкаНаВозвратТовары.Ссылка.Реализация КАК Реализация,
		|	ЗаявкаНаВозвратТовары.НомерСтрокиИзРТУ,
		|	СУММА(ЗаявкаНаВозвратТовары.Количество) КАК Количество
		|ПОМЕСТИТЬ ЗаявкиНаВозврат
		|ИЗ
		|	ТаблицаКлиентов КАК ТаблицаКлиентов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВозврат.Товары КАК ЗаявкаНаВозвратТовары
		|		ПО ТаблицаКлиентов.Ссылка = ЗаявкаНаВозвратТовары.Ссылка.Реализация.Контрагент
		|ГДЕ
		|	ЗаявкаНаВозвратТовары.Ссылка.Статус <> ""Отменен""
		|	И ЗаявкаНаВозвратТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаВозвратТовары.Номенклатура,
		|	ЗаявкаНаВозвратТовары.НомерСтрокиИзРТУ,
		|	ЗаявкаНаВозвратТовары.Ссылка.Реализация
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура,
		|	Реализация
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РеализацияТоваровУслугТовары.Ссылка КАК Реализация,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	СРЕДНЕЕ(РеализацияТоваровУслугТовары.Цена) КАК Цена,
		|	СУММА(РеализацияТоваровУслугТовары.Количество) КАК Количество,
		|	РеализацияТоваровУслугТовары.НомерСтроки КАК НомерСтроки,
		|	РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада КАК IDСклада,
		|	РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада_СтороннийСклад КАК IDСклада_СтороннийСклад
		|ПОМЕСТИТЬ ТаблЧасть
		|ИЗ
		|	ТаблицаКлиентов КАК ТаблицаКлиентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Товары КАК РеализацияТоваровУслугТовары
		|			ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугТовары.Ссылка
		|		ПО ТаблицаКлиентов.Ссылка = РеализацияТоваровУслуг.Грузополучатель
		|ГДЕ
		|	РеализацияТоваровУслугТовары.Ссылка.Проведен
		|	И ВЫБОР
		|			КОГДА &НомерДокумента = """"
		|				ТОГДА РеализацияТоваровУслугТовары.Ссылка.Дата МЕЖДУ &ДатаНач И &ДатаКон
		|			ИНАЧЕ РеализацияТоваровУслугТовары.Ссылка = &ДокументРеализации
		|		КОНЕЦ
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслугТовары.Ссылка,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада,
		|	РеализацияТоваровУслугТовары.НомерСтроки,
		|	РеализацияТоваровУслугТовары.ЗаказПокупателя.IDСклада_СтороннийСклад
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Реализация,
		|	РеализацияТоваровУслугТовары.Номенклатура,
		|	IDСклада,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажиОбороты.ДокументПродажи КАК ДокументПродажи,
		|	ПродажиОбороты.Номенклатура КАК Номенклатура,
		|	ПродажиОбороты.НомерСтроки КАК НомерСтроки,
		|	СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот
		|ПОМЕСТИТЬ ТаблПродаж
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(
		|			&ДатаНач,
		|			&ДатаКон,
		|			Запись,
		|			(ДокументПродажи, Номенклатура) В
		|				(ВЫБРАТЬ
		|					ТаблЧасть.Реализация КАК ДокументПродажи,
		|					ТаблЧасть.Номенклатура
		|				ИЗ
		|					ТаблЧасть КАК ТаблЧасть)) КАК ПродажиОбороты
		|ГДЕ
		|	ПродажиОбороты.Регистратор ССЫЛКА Документ.РеализацияТоваровУслуг
		|
		|СГРУППИРОВАТЬ ПО
		|	ПродажиОбороты.Номенклатура,
		|	ПродажиОбороты.ДокументПродажи,
		|	ПродажиОбороты.НомерСтроки
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	ДокументПродажи,
		|	Номенклатура,
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЧасть.Реализация,
		|	ТаблЧасть.Номенклатура,
		|	ТаблЧасть.Цена,
		|	ТаблЧасть.Количество,
		|	ТаблЧасть.НомерСтроки,
		|	СУММА(ТаблПродаж.КоличествоОборот - ВЫБОР
		|			КОГДА ЗаявкиНаВозврат.Количество ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ЗаявкиНаВозврат.Количество
		|		КОНЕЦ) КАК КоличествоДляВозврата,
		|	СУММА(ТаблПродаж.КоличествоОборот) КАК ТаблПродаж_КоличествоОборот,
		|	СУММА(ЗаявкиНаВозврат.Количество) КАК ЗаявкиНаВозврат_Количество,
		|	ТаблЧасть.IDСклада_СтороннийСклад КАК IDСклада_СтороннийСклад,
		|	ТаблЧасть.IDСклада КАК IDСклада
		|ПОМЕСТИТЬ ТаблЗаказа
		|ИЗ
		|	ТаблЧасть КАК ТаблЧасть
		|		ЛЕВОЕ СОЕДИНЕНИЕ ЗаявкиНаВозврат КАК ЗаявкиНаВозврат
		|		ПО ТаблЧасть.Реализация = ЗаявкиНаВозврат.Реализация
		|			И ТаблЧасть.Номенклатура = ЗаявкиНаВозврат.Номенклатура
		|			И ТаблЧасть.НомерСтроки = ЗаявкиНаВозврат.НомерСтрокиИзРТУ
		|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблПродаж КАК ТаблПродаж
		|		ПО ТаблЧасть.Реализация = ТаблПродаж.ДокументПродажи
		|			И ТаблЧасть.Номенклатура = ТаблПродаж.Номенклатура
		|			И ТаблЧасть.НомерСтроки = ТаблПродаж.НомерСтроки
		|ГДЕ
		|	(&Артикул = """"
		|			ИЛИ ТаблЧасть.Номенклатура.КодПроизводителя ПОДОБНО &Артикул
		|			ИЛИ СТРЗАМЕНИТЬ(СТРЗАМЕНИТЬ(ТаблЧасть.Номенклатура.КодПроизводителя, "" "", """"), ""-"", """") ПОДОБНО &АртикулНормализованный)
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблЧасть.Реализация,
		|	ТаблЧасть.НомерСтроки,
		|	ТаблЧасть.Номенклатура,
		|	ТаблЧасть.Цена,
		|	ТаблЧасть.Количество,
		|	ТаблЧасть.IDСклада_СтороннийСклад,
		|	ТаблЧасть.IDСклада
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	IDСклада
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТаблЗаказа.Реализация,
		|	ТаблЗаказа.Номенклатура,
		|	СУММА(ТаблЗаказа.Цена) КАК Цена,
		|	СУММА(ВЫБОР
		|			КОГДА ТаблЗаказа.Количество ЕСТЬ NULL
		|				ТОГДА 0
		|			ИНАЧЕ ТаблЗаказа.Количество
		|		КОНЕЦ) КАК Количество,
		|	ТаблЗаказа.НомерСтроки,
		|	СУММА(ТаблЗаказа.КоличествоДляВозврата) КАК КоличествоДляВозврата,
		|	ТаблЗаказа.IDСклада,
		|	МАКСИМУМ(ВЫБОР
		|			КОГДА СторонниеСклады.Ссылка ЕСТЬ NULL
		|				ТОГДА ЛОЖЬ
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ) КАК ЭтоСтороннийСклад,
		|	СчетФактураВыданный.Ссылка КАК СчетФактура
		|ПОМЕСТИТЬ ИтоговаяТаблица
		|ИЗ
		|	ТаблЗаказа КАК ТаблЗаказа
		|		ЛЕВОЕ СОЕДИНЕНИЕ СторонниеСклады КАК СторонниеСклады
		|		ПО ТаблЗаказа.IDСклада_СтороннийСклад = СторонниеСклады.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный КАК СчетФактураВыданный
		|		ПО ТаблЗаказа.Реализация = СчетФактураВыданный.ДокументОснование
		|
		|СГРУППИРОВАТЬ ПО
		|	ТаблЗаказа.Реализация,
		|	ТаблЗаказа.Номенклатура,
		|	ТаблЗаказа.НомерСтроки,
		|	ТаблЗаказа.IDСклада,
		|	СчетФактураВыданный.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИтоговаяТаблица.Реализация.Ссылка КАК Ссылка,
		|	ИтоговаяТаблица.Реализация.Номер КАК DCODE_6051,
		|	ИтоговаяТаблица.Реализация.Дата КАК DDATE1_6051,
		|	ИтоговаяТаблица.Реализация.Грузополучатель.Наименование КАК FILIAL_NAME,
		|	ИтоговаяТаблица.Реализация.Комментарий КАК DNOTE,
		|	ИтоговаяТаблица.Реализация.ВалютаДокумента.Наименование КАК VALUTA,
		|	ИтоговаяТаблица.Реализация.ДоговорКонтрагента.Наименование КАК DOGOVOR_NAME,
		|	ИтоговаяТаблица.Реализация.Склад.Наименование КАК SKLAD_NAME,
		|	ВЫРАЗИТЬ(ИтоговаяТаблица.Реализация.Организация.Наименование КАК СТРОКА(80)) КАК OUR_FIRM,
		|	""Москворечье Трейдинг"" КАК UR_LICO,
		|	ИтоговаяТаблица.Номенклатура.КодПоБазеМоскоречье КАК INV_NUM,
		|	ИтоговаяТаблица.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент КАК KOEF,
		|	ИтоговаяТаблица.Количество КАК KOL_VO,
		|	ИтоговаяТаблица.Цена КАК PRICE,
		|	"""" КАК TOVAR_PRIMECH,
		|	ИтоговаяТаблица.Количество * ИтоговаяТаблица.Цена КАК SUMMA,
		|	ИтоговаяТаблица.Номенклатура.КодПроизводителя КАК ARTICUL_OUT,
		|	ИтоговаяТаблица.Номенклатура.Наименование КАК TOVAR_NAME,
		|	ЕСТЬNULL(ИтоговаяТаблица.Номенклатура.Родитель.Наименование, """") КАК BREND,
		|	ИтоговаяТаблица.Номенклатура.ЕдиницаХраненияОстатков.Наименование КАК ED_IZM,
		|	ИтоговаяТаблица.Номенклатура КАК Номенклатура,
		|	ИтоговаяТаблица.НомерСтроки КАК EID,
		|	ВЫБОР
		|		КОГДА ИтоговаяТаблица.ЭтоСтороннийСклад
		|			ТОГДА 0
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК FLAG_1,
		|	ЕСТЬNULL(ИтоговаяТаблица.КоличествоДляВозврата, 0) КАК CAN_RETURN,
		|	ИтоговаяТаблица.СчетФактура
		|ИЗ
		|	ИтоговаяТаблица КАК ИтоговаяТаблица
		|ГДЕ
		|	ВЫБОР
		|			КОГДА НЕ ИтоговаяТаблица.ЭтоСтороннийСклад
		|				ТОГДА НЕ ИтоговаяТаблица.Номенклатура.НеПодлежитВозврату
		|			ИНАЧЕ ИСТИНА
		|		КОНЕЦ
		|
		|УПОРЯДОЧИТЬ ПО
		|	DDATE1_6051 УБЫВ,
		|	DCODE_6051 УБЫВ,
		|	EID
		|ИТОГИ
		|	СУММА(KOL_VO),
		|	СУММА(PRICE),
		|	СУММА(SUMMA)
		|ПО
		|	Ссылка,
		|	Номенклатура";

		Если ИскатьПоКодуМДМ Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ".IDАварда", ".КодМДМ");
		КонецЕсли;

		Если ИскатьФилиалыПоКодуМДМ Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Контрагенты.IDАварда В(&СписокИД)", "Контрагенты.КодМДМ В(&СписокИД)");
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "Контрагенты.КодМДМ В(&СписокИД)", "Контрагенты.IDАварда В(&СписокИД)");
		КонецЕсли;

		ТаблСФ = Новый ТаблицаЗначений;
		ТаблСФ.Колонки.Добавить("Документ");
		ТаблСФ.Колонки.Добавить("DDATE1_6051");
		ТаблСФ.Колонки.Добавить("DCODE_6051");
		
		ЗапросЗаказовПоСтатусам.Текст = ТекстЗапроса;
		
		РезультатЗапросаЗаказовПоСтатусам = ЗапросЗаказовПоСтатусам.Выполнить();
		
		Если НЕ РезультатЗапросаЗаказовПоСтатусам.Пустой() Тогда
			
			ВыборкаРезультата1 = РезультатЗапросаЗаказовПоСтатусам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаРезультата1.Следующий() Цикл
				
				ВыборкаРезультата2 = ВыборкаРезультата1.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаРезультата2.Следующий() Цикл
					
					ВыборкаРезультата = ВыборкаРезультата2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаРезультата.Следующий() Цикл				
						
						СтрокаВозврата = ФабрикаXDTO.Создать(ТипСтрокаОтвета);
						ЗаполнитьЗначенияСвойств(СтрокаВозврата,ВыборкаРезультата);
						
						ЕстьРН = ЗначениеЗаполнено(ВыборкаРезультата.Ссылка);
						
						Если ЕстьРН Тогда
							СтрокаВозврата.DID_6051    = СокрЛП(ВыборкаРезультата.Ссылка.УникальныйИдентификатор());
							СтрокаВозврата.DDATE1_6051 = Формат(ВыборкаРезультата.DDATE1_6051, "ДФ='yyyy-MM-ddTHH:mm:ss'");
							СтрокаВозврата.DCODE_6051 = ВыборкаРезультата.DCODE_6051;
						КонецЕсли; 		  				

						СтрокаТЗ = ПолучитьДанныеСФ(ВыборкаРезультата.Ссылка,ВыборкаРезультата.СчетФактура,ТаблСФ);

						Если ЗначениеЗаполнено(СтрокаТЗ.DCODE_6051) Тогда 
							СтрокаВозврата.DCODE_6051 = СтрокаТЗ.DCODE_6051;
						КонецЕсли;
						
						Если ЗначениеЗаполнено(СтрокаТЗ.DDATE1_6051) Тогда 
							СтрокаВозврата.DDATE1_6051 = СтрокаТЗ.DDATE1_6051;
						КонецЕсли; 

						СтрокаВозврата.SF = "";
						
						РезультатДляВозвратаПорталу.Row.Добавить(СтрокаВозврата);
						
					КонецЦикла;
					
				КонецЦикла;
				
			КонецЦикла;	
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Возврат РезультатДляВозвратаПорталу;
	
КонецФункции

Функция ПолучитьДанныеСФ(Документ, СФ, ТЗ)
	
	Строка = ТЗ.Найти(Документ);
	
	Если Строка = Неопределено тогда
		
		Строка = ТЗ.Добавить();
		Строка.Документ = Документ;
		СчетФактура = СФ;
		
		Если ЗначениеЗаполнено(СчетФактура) тогда
			
			Строка.DCODE_6051 = ОбщегоНазначения.ПолучитьНомерНаПечать(СчетФактура) + " от " + Формат(СчетФактура.Дата, "ДФ='дд ММММ гггг'") + " г.";
			Строка.DDATE1_6051 = Формат(СчетФактура.Дата,"ДФ='yyyy-MM-ddTHH:mm:ss'");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Строка;

КонецФункции
